ИС_СПОРТ_2022/src/Catalogs/СпортивныеОбъекты/СпортивныеОбъекты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СпортивныеОбъекты</name>
  <owners>Catalog.Организации</owners>
  <attributes>
    <name>Адрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПолныйАдрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Широта</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>13</precision>
        <scale>10</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Долгота</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>13</precision>
        <scale>10</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Вместимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

ИС_СПОРТ_2022/src/Catalogs/СпортивныеОбъекты/Forms/ФормаЭлемента/Module.bsl
// {Рарус adilas #13548 -Справочник Места занятий 2021.02.25
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// {Рарус dotere #21664 -Убрал проверку на роль, не нужна 2021.10.28
	//Если РольДоступна("Методист") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Владелец", Объект.Ссылка ,ВидСравненияКомпоновкиДанных.Равно, , Истина); 
		// {Рарус dotere #21644 -Не заполняет владельца у записанного элемента 2021.10.28
		Если Объект.Ссылка.Пустая() И Не ПараметрыСеанса.ТекущаяОрганизация.Пустая() Тогда																			
			Объект.Владелец = ПараметрыСеанса.ТекущаяОрганизация;
		КонецЕсли;
		// }Рарус dotere #21644 -Не заполняет владельца у записанного элемента 2021.10.28

	//КонецЕсли;
	// }Рарус dotere #21664 -Убрал проверку на роль, не нужна 2021.10.28
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если НЕ Копирование Тогда
		Отказ = Истина;
		ОткрытьФорму("Справочник.МестаЗанятий.Форма.ФормаЭлемента", Новый Структура("СпортивныйОбъект", Объект.Ссылка));
	КонецЕсли;
	
КонецПроцедуры
// {Рарус dotere #21984 -Обновление данных таблицы после записи места занятий 2021.11.02
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	Если ИмяСобытия = "ОбновитьМестаЗанятий" Тогда
		Элементы.Список.Обновить();
	КонецЕсли;                               

КонецПроцедуры
// }Рарус dotere #21984 -Обновление данных таблицы после записи места занятий 2021.11.02

&НаКлиенте
Процедура РасписаниеОбъекта(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("СпортивныйОбъект", Объект.Ссылка);
	
	ОткрытьФорму("ОбщаяФорма.ПланировщикРасписанияПоМестам", ПараметрыФормы);
	
КонецПроцедуры

//{Рарус ivaart IN-19390 Географические объекты. Получение кооррдинат по адресу и их проверка 2021.08.25
&НаКлиенте
Процедура ПолучитьДанные(Команда)
	Если Не ПустаяСтрока(Объект.Адрес) тогда
		Координаты = HTTPЗапросыСервер.КоординатыПоАдресу(Объект.Адрес);
		Если Не Координаты.Свойство("Ошибка") тогда
			// {Рарус dotere #22983 -убирает лишнее из адреса 2022.01.12
			Адрес = Координаты.ПолныйАдрес;
			Если ПроверкаАдреса(Координаты.ПолныйАдрес) Тогда
				АдресЗначение = СтрНайти(Координаты.ПолныйАдрес,",");
				АдресЛишнее = Сред(Координаты.ПолныйАдрес,0,АдресЗначение+1);
				Адрес = СтрЗаменить(Координаты.ПолныйАдрес,АдресЛишнее,"");
			КонецЕсли;
			// }Рарус dotere #22983 -убирает лишнее из адреса 2022.01.12
			Объект.Широта = Координаты.Широта;
			Объект.Долгота = Координаты.Долгота;
			Объект.ПолныйАдрес = Адрес;
			ПоказатьЗначение(,"Координаты получены! Проверьте правильность полного адреса перед записью.");
		Иначе
			ПоказатьЗначение(,Координаты.Ошибка);
		КонецЕсли;
	Иначе
		ПоказатьЗначение(,"Поле адреса является пустым!");
	КонецЕсли;
КонецПроцедуры
// {Рарус dotere #22983 -Проверка на некорректный адрес 2022.01.12
Функция ПроверкаАдреса(ПолныйАдрес)
	Возврат РаботаСАдресами.СведенияОбАдресе(ПолныйАдрес).Представление = "";
КонецФункции
// }Рарус dotere #22983 -Проверка на некорректный адрес 2022.01.12
&НаКлиенте
Процедура ПроверитьДанные(Команда)
	Если Не ПустаяСтрока(Объект.ПолныйАдрес) тогда
		Ссылка = "https://yandex.ru/maps/?mode=search&text="+СтрЗаменить(СтроковыеФункцииКлиент.СтрокаЛатиницей(Объект.ПолныйАдрес)," ","+");
		#Если Не ВебКлиент тогда
			ЗапуститьПриложение(Ссылка);
			//ie= Новый COMОбъект("\InternetExplorer.Application\"); 

			//ie.Visible=1; 

			////ie.Navigate("https://yandex.ru/maps/?mode=search&text="+СтрЗаменить(Объект.ПолныйАдрес," ","+"));
			//ie.Navigate("https://yandex.ru/maps/?mode=search&text="+СтрЗаменить(Объект.ПолныйАдрес," ","+")); 
		#Иначе
			ПерейтиПоНавигационнойСсылке(Ссылка);
		#КонецЕсли
	Иначе
		ПоказатьЗначение(,"Полный адрес должен быть заполнен!");
	КонецЕсли;
КонецПроцедуры
// {Рарус dotere #21984 -После записи заново устанавливает отбор 2021.11.03
&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Владелец", Объект.Ссылка ,ВидСравненияКомпоновкиДанных.Равно, , Истина);
КонецПроцедуры
// }Рарус dotere #21984 -После записи заново устанавливает отбор 2021.11.03
//{Рарус ivaart IN-19390 Географические объекты. Получение кооррдинат по адресу и их проверка 2021.08.25
// }Рарус adilas #13548 -Справочник Места занятий 2021.02.25
